GopalSaraf/Practicals/PSDL/include/proc/pic18lf2331.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF2331_INC_
#define _PIC18LF2331_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18LF2331
 */

/*
 * Device Registers
 */

// Register: DFLTCON
#define DFLTCON DFLTCON
DFLTCON                                  equ 0F60h
// bitfield definitions
DFLTCON_FLTCK_POSN                       equ 0000h
DFLTCON_FLTCK_POSITION                   equ 0000h
DFLTCON_FLTCK_SIZE                       equ 0003h
DFLTCON_FLTCK_LENGTH                     equ 0003h
DFLTCON_FLTCK_MASK                       equ 0007h
DFLTCON_FLT1EN_POSN                      equ 0003h
DFLTCON_FLT1EN_POSITION                  equ 0003h
DFLTCON_FLT1EN_SIZE                      equ 0001h
DFLTCON_FLT1EN_LENGTH                    equ 0001h
DFLTCON_FLT1EN_MASK                      equ 0008h
DFLTCON_FLT2EN_POSN                      equ 0004h
DFLTCON_FLT2EN_POSITION                  equ 0004h
DFLTCON_FLT2EN_SIZE                      equ 0001h
DFLTCON_FLT2EN_LENGTH                    equ 0001h
DFLTCON_FLT2EN_MASK                      equ 0010h
DFLTCON_FLT3EN_POSN                      equ 0005h
DFLTCON_FLT3EN_POSITION                  equ 0005h
DFLTCON_FLT3EN_SIZE                      equ 0001h
DFLTCON_FLT3EN_LENGTH                    equ 0001h
DFLTCON_FLT3EN_MASK                      equ 0020h
DFLTCON_FLT4EN_POSN                      equ 0006h
DFLTCON_FLT4EN_POSITION                  equ 0006h
DFLTCON_FLT4EN_SIZE                      equ 0001h
DFLTCON_FLT4EN_LENGTH                    equ 0001h
DFLTCON_FLT4EN_MASK                      equ 0040h
DFLTCON_FLTCK0_POSN                      equ 0000h
DFLTCON_FLTCK0_POSITION                  equ 0000h
DFLTCON_FLTCK0_SIZE                      equ 0001h
DFLTCON_FLTCK0_LENGTH                    equ 0001h
DFLTCON_FLTCK0_MASK                      equ 0001h
DFLTCON_FLTCK1_POSN                      equ 0001h
DFLTCON_FLTCK1_POSITION                  equ 0001h
DFLTCON_FLTCK1_SIZE                      equ 0001h
DFLTCON_FLTCK1_LENGTH                    equ 0001h
DFLTCON_FLTCK1_MASK                      equ 0002h
DFLTCON_FLTCK2_POSN                      equ 0002h
DFLTCON_FLTCK2_POSITION                  equ 0002h
DFLTCON_FLTCK2_SIZE                      equ 0001h
DFLTCON_FLTCK2_LENGTH                    equ 0001h
DFLTCON_FLTCK2_MASK                      equ 0004h

// Register: CAP3CON
#define CAP3CON CAP3CON
CAP3CON                                  equ 0F61h
// bitfield definitions
CAP3CON_CAP3M_POSN                       equ 0000h
CAP3CON_CAP3M_POSITION                   equ 0000h
CAP3CON_CAP3M_SIZE                       equ 0004h
CAP3CON_CAP3M_LENGTH                     equ 0004h
CAP3CON_CAP3M_MASK                       equ 000Fh
CAP3CON_CAP3TMR_POSN                     equ 0005h
CAP3CON_CAP3TMR_POSITION                 equ 0005h
CAP3CON_CAP3TMR_SIZE                     equ 0001h
CAP3CON_CAP3TMR_LENGTH                   equ 0001h
CAP3CON_CAP3TMR_MASK                     equ 0020h
CAP3CON_CAP3REN_POSN                     equ 0006h
CAP3CON_CAP3REN_POSITION                 equ 0006h
CAP3CON_CAP3REN_SIZE                     equ 0001h
CAP3CON_CAP3REN_LENGTH                   equ 0001h
CAP3CON_CAP3REN_MASK                     equ 0040h
CAP3CON_CAP3M0_POSN                      equ 0000h
CAP3CON_CAP3M0_POSITION                  equ 0000h
CAP3CON_CAP3M0_SIZE                      equ 0001h
CAP3CON_CAP3M0_LENGTH                    equ 0001h
CAP3CON_CAP3M0_MASK                      equ 0001h
CAP3CON_CAP3M1_POSN                      equ 0001h
CAP3CON_CAP3M1_POSITION                  equ 0001h
CAP3CON_CAP3M1_SIZE                      equ 0001h
CAP3CON_CAP3M1_LENGTH                    equ 0001h
CAP3CON_CAP3M1_MASK                      equ 0002h
CAP3CON_CAP3M2_POSN                      equ 0002h
CAP3CON_CAP3M2_POSITION                  equ 0002h
CAP3CON_CAP3M2_SIZE                      equ 0001h
CAP3CON_CAP3M2_LENGTH                    equ 0001h
CAP3CON_CAP3M2_MASK                      equ 0004h
CAP3CON_CAP3M3_POSN                      equ 0003h
CAP3CON_CAP3M3_POSITION                  equ 0003h
CAP3CON_CAP3M3_SIZE                      equ 0001h
CAP3CON_CAP3M3_LENGTH                    equ 0001h
CAP3CON_CAP3M3_MASK                      equ 0008h

// Register: CAP2CON
#define CAP2CON CAP2CON
CAP2CON                                  equ 0F62h
// bitfield definitions
CAP2CON_CAP2M_POSN                       equ 0000h
CAP2CON_CAP2M_POSITION                   equ 0000h
CAP2CON_CAP2M_SIZE                       equ 0004h
CAP2CON_CAP2M_LENGTH                     equ 0004h
CAP2CON_CAP2M_MASK                       equ 000Fh
CAP2CON_CAP2TMR_POSN                     equ 0005h
CAP2CON_CAP2TMR_POSITION                 equ 0005h
CAP2CON_CAP2TMR_SIZE                     equ 0001h
CAP2CON_CAP2TMR_LENGTH                   equ 0001h
CAP2CON_CAP2TMR_MASK                     equ 0020h
CAP2CON_CAP2REN_POSN                     equ 0006h
CAP2CON_CAP2REN_POSITION                 equ 0006h
CAP2CON_CAP2REN_SIZE                     equ 0001h
CAP2CON_CAP2REN_LENGTH                   equ 0001h
CAP2CON_CAP2REN_MASK                     equ 0040h
CAP2CON_CAP2M0_POSN                      equ 0000h
CAP2CON_CAP2M0_POSITION                  equ 0000h
CAP2CON_CAP2M0_SIZE                      equ 0001h
CAP2CON_CAP2M0_LENGTH                    equ 0001h
CAP2CON_CAP2M0_MASK                      equ 0001h
CAP2CON_CAP2M1_POSN                      equ 0001h
CAP2CON_CAP2M1_POSITION                  equ 0001h
CAP2CON_CAP2M1_SIZE                      equ 0001h
CAP2CON_CAP2M1_LENGTH                    equ 0001h
CAP2CON_CAP2M1_MASK                      equ 0002h
CAP2CON_CAP2M2_POSN                      equ 0002h
CAP2CON_CAP2M2_POSITION                  equ 0002h
CAP2CON_CAP2M2_SIZE                      equ 0001h
CAP2CON_CAP2M2_LENGTH                    equ 0001h
CAP2CON_CAP2M2_MASK                      equ 0004h
CAP2CON_CAP2M3_POSN                      equ 0003h
CAP2CON_CAP2M3_POSITION                  equ 0003h
CAP2CON_CAP2M3_SIZE                      equ 0001h
CAP2CON_CAP2M3_LENGTH                    equ 0001h
CAP2CON_CAP2M3_MASK                      equ 0008h

