GopalSaraf/Practicals/PSDL/include/proc/pic18lf2331.inc
// Register: SEVTCMPH
#define SEVTCMPH SEVTCMPH
SEVTCMPH                                 equ 0F70h

// Register: SEVTCMPL
#define SEVTCMPL SEVTCMPL
SEVTCMPL                                 equ 0F71h

// Register: PDC2H
#define PDC2H PDC2H
PDC2H                                    equ 0F74h

// Register: PDC2L
#define PDC2L PDC2L
PDC2L                                    equ 0F75h

// Register: PDC1H
#define PDC1H PDC1H
PDC1H                                    equ 0F76h

// Register: PDC1L
#define PDC1L PDC1L
PDC1L                                    equ 0F77h

// Register: PDC0H
#define PDC0H PDC0H
PDC0H                                    equ 0F78h

// Register: PDC0L
#define PDC0L PDC0L
PDC0L                                    equ 0F79h

// Register: PTPERH
#define PTPERH PTPERH
PTPERH                                   equ 0F7Ah

// Register: PTPERL
#define PTPERL PTPERL
PTPERL                                   equ 0F7Bh

// Register: PTMRH
#define PTMRH PTMRH
PTMRH                                    equ 0F7Ch

// Register: PTMRL
#define PTMRL PTMRL
PTMRL                                    equ 0F7Dh

// Register: PTCON1
#define PTCON1 PTCON1
PTCON1                                   equ 0F7Eh
// bitfield definitions
PTCON1_PTDIR_POSN                        equ 0006h
PTCON1_PTDIR_POSITION                    equ 0006h
PTCON1_PTDIR_SIZE                        equ 0001h
PTCON1_PTDIR_LENGTH                      equ 0001h
PTCON1_PTDIR_MASK                        equ 0040h
PTCON1_PTEN_POSN                         equ 0007h
PTCON1_PTEN_POSITION                     equ 0007h
PTCON1_PTEN_SIZE                         equ 0001h
PTCON1_PTEN_LENGTH                       equ 0001h
PTCON1_PTEN_MASK                         equ 0080h

// Register: PTCON0
#define PTCON0 PTCON0
PTCON0                                   equ 0F7Fh
// bitfield definitions
PTCON0_PTMOD_POSN                        equ 0000h
PTCON0_PTMOD_POSITION                    equ 0000h
PTCON0_PTMOD_SIZE                        equ 0002h
PTCON0_PTMOD_LENGTH                      equ 0002h
PTCON0_PTMOD_MASK                        equ 0003h
PTCON0_PTCKPS_POSN                       equ 0002h
PTCON0_PTCKPS_POSITION                   equ 0002h
PTCON0_PTCKPS_SIZE                       equ 0002h
PTCON0_PTCKPS_LENGTH                     equ 0002h
PTCON0_PTCKPS_MASK                       equ 000Ch
PTCON0_PTOPS_POSN                        equ 0004h
PTCON0_PTOPS_POSITION                    equ 0004h
PTCON0_PTOPS_SIZE                        equ 0004h
PTCON0_PTOPS_LENGTH                      equ 0004h
PTCON0_PTOPS_MASK                        equ 00F0h
PTCON0_PTMOD0_POSN                       equ 0000h
PTCON0_PTMOD0_POSITION                   equ 0000h
PTCON0_PTMOD0_SIZE                       equ 0001h
PTCON0_PTMOD0_LENGTH                     equ 0001h
PTCON0_PTMOD0_MASK                       equ 0001h
PTCON0_PTMOD1_POSN                       equ 0001h
PTCON0_PTMOD1_POSITION                   equ 0001h
PTCON0_PTMOD1_SIZE                       equ 0001h
PTCON0_PTMOD1_LENGTH                     equ 0001h
PTCON0_PTMOD1_MASK                       equ 0002h
PTCON0_PTCKPS0_POSN                      equ 0002h
PTCON0_PTCKPS0_POSITION                  equ 0002h
PTCON0_PTCKPS0_SIZE                      equ 0001h
PTCON0_PTCKPS0_LENGTH                    equ 0001h
PTCON0_PTCKPS0_MASK                      equ 0004h
PTCON0_PTCKPS1_POSN                      equ 0003h
PTCON0_PTCKPS1_POSITION                  equ 0003h
PTCON0_PTCKPS1_SIZE                      equ 0001h
PTCON0_PTCKPS1_LENGTH                    equ 0001h
PTCON0_PTCKPS1_MASK                      equ 0008h
PTCON0_PTOPS0_POSN                       equ 0004h
PTCON0_PTOPS0_POSITION                   equ 0004h
PTCON0_PTOPS0_SIZE                       equ 0001h
PTCON0_PTOPS0_LENGTH                     equ 0001h
PTCON0_PTOPS0_MASK                       equ 0010h
PTCON0_PTOPS1_POSN                       equ 0005h
PTCON0_PTOPS1_POSITION                   equ 0005h
PTCON0_PTOPS1_SIZE                       equ 0001h
PTCON0_PTOPS1_LENGTH                     equ 0001h
PTCON0_PTOPS1_MASK                       equ 0020h
PTCON0_PTOPS2_POSN                       equ 0006h
PTCON0_PTOPS2_POSITION                   equ 0006h
PTCON0_PTOPS2_SIZE                       equ 0001h
PTCON0_PTOPS2_LENGTH                     equ 0001h
PTCON0_PTOPS2_MASK                       equ 0040h
PTCON0_PTOPS3_POSN                       equ 0007h
PTCON0_PTOPS3_POSITION                   equ 0007h
PTCON0_PTOPS3_SIZE                       equ 0001h
PTCON0_PTOPS3_LENGTH                     equ 0001h
PTCON0_PTOPS3_MASK                       equ 0080h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0F80h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA6_POSN                           equ 0006h
PORTA_RA6_POSITION                       equ 0006h
PORTA_RA6_SIZE                           equ 0001h
PORTA_RA6_LENGTH                         equ 0001h
PORTA_RA6_MASK                           equ 0040h
PORTA_RA7_POSN                           equ 0007h
PORTA_RA7_POSITION                       equ 0007h
PORTA_RA7_SIZE                           equ 0001h
PORTA_RA7_LENGTH                         equ 0001h
PORTA_RA7_MASK                           equ 0080h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_AN2_POSN                           equ 0002h
PORTA_AN2_POSITION                       equ 0002h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0004h
PORTA_AN3_POSN                           equ 0003h
PORTA_AN3_POSITION                       equ 0003h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0008h
PORTA_AN4_POSN                           equ 0004h
PORTA_AN4_POSITION                       equ 0004h
PORTA_AN4_SIZE                           equ 0001h
PORTA_AN4_LENGTH                         equ 0001h
PORTA_AN4_MASK                           equ 0010h
PORTA_OSC2_POSN                          equ 0006h
PORTA_OSC2_POSITION                      equ 0006h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0040h
PORTA_OSC1_POSN                          equ 0007h
PORTA_OSC1_POSITION                      equ 0007h
PORTA_OSC1_SIZE                          equ 0001h
PORTA_OSC1_LENGTH                        equ 0001h
PORTA_OSC1_MASK                          equ 0080h
PORTA_VREFM_POSN                         equ 0002h
PORTA_VREFM_POSITION                     equ 0002h
PORTA_VREFM_SIZE                         equ 0001h
PORTA_VREFM_LENGTH                       equ 0001h
PORTA_VREFM_MASK                         equ 0004h
PORTA_VREFP_POSN                         equ 0003h
PORTA_VREFP_POSITION                     equ 0003h
PORTA_VREFP_SIZE                         equ 0001h
PORTA_VREFP_LENGTH                       equ 0001h
PORTA_VREFP_MASK                         equ 0008h
PORTA_CLKO_POSN                          equ 0006h
PORTA_CLKO_POSITION                      equ 0006h
PORTA_CLKO_SIZE                          equ 0001h
PORTA_CLKO_LENGTH                        equ 0001h
PORTA_CLKO_MASK                          equ 0040h
PORTA_CLKI_POSN                          equ 0007h
PORTA_CLKI_POSITION                      equ 0007h
PORTA_CLKI_SIZE                          equ 0001h
PORTA_CLKI_LENGTH                        equ 0001h
PORTA_CLKI_MASK                          equ 0080h
PORTA_ULPWUIN_POSN                       equ 0000h
PORTA_ULPWUIN_POSITION                   equ 0000h
PORTA_ULPWUIN_SIZE                       equ 0001h
PORTA_ULPWUIN_LENGTH                     equ 0001h
PORTA_ULPWUIN_MASK                       equ 0001h
PORTA_RJPU_POSN                          equ 0007h
PORTA_RJPU_POSITION                      equ 0007h
PORTA_RJPU_SIZE                          equ 0001h
PORTA_RJPU_LENGTH                        equ 0001h
PORTA_RJPU_MASK                          equ 0080h

// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0F81h
// bitfield definitions
PORTB_RB0_POSN                           equ 0000h
PORTB_RB0_POSITION                       equ 0000h
PORTB_RB0_SIZE                           equ 0001h
PORTB_RB0_LENGTH                         equ 0001h
PORTB_RB0_MASK                           equ 0001h
PORTB_RB1_POSN                           equ 0001h
PORTB_RB1_POSITION                       equ 0001h
PORTB_RB1_SIZE                           equ 0001h
PORTB_RB1_LENGTH                         equ 0001h
PORTB_RB1_MASK                           equ 0002h
PORTB_RB2_POSN                           equ 0002h
PORTB_RB2_POSITION                       equ 0002h
PORTB_RB2_SIZE                           equ 0001h
PORTB_RB2_LENGTH                         equ 0001h
PORTB_RB2_MASK                           equ 0004h
PORTB_RB3_POSN                           equ 0003h
PORTB_RB3_POSITION                       equ 0003h
PORTB_RB3_SIZE                           equ 0001h
PORTB_RB3_LENGTH                         equ 0001h
PORTB_RB3_MASK                           equ 0008h
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_CCP2_PA2_POSN                      equ 0003h
PORTB_CCP2_PA2_POSITION                  equ 0003h
PORTB_CCP2_PA2_SIZE                      equ 0001h
PORTB_CCP2_PA2_LENGTH                    equ 0001h
PORTB_CCP2_PA2_MASK                      equ 0008h

// Register: PORTC
#define PORTC PORTC
PORTC                                    equ 0F82h
// bitfield definitions
PORTC_RC0_POSN                           equ 0000h
PORTC_RC0_POSITION                       equ 0000h
PORTC_RC0_SIZE                           equ 0001h
PORTC_RC0_LENGTH                         equ 0001h
PORTC_RC0_MASK                           equ 0001h
PORTC_RC1_POSN                           equ 0001h
PORTC_RC1_POSITION                       equ 0001h
PORTC_RC1_SIZE                           equ 0001h
PORTC_RC1_LENGTH                         equ 0001h
PORTC_RC1_MASK                           equ 0002h
PORTC_RC2_POSN                           equ 0002h
PORTC_RC2_POSITION                       equ 0002h
PORTC_RC2_SIZE                           equ 0001h
PORTC_RC2_LENGTH                         equ 0001h
PORTC_RC2_MASK                           equ 0004h
PORTC_RC3_POSN                           equ 0003h
PORTC_RC3_POSITION                       equ 0003h
PORTC_RC3_SIZE                           equ 0001h
PORTC_RC3_LENGTH                         equ 0001h
PORTC_RC3_MASK                           equ 0008h
PORTC_RC4_POSN                           equ 0004h
PORTC_RC4_POSITION                       equ 0004h
PORTC_RC4_SIZE                           equ 0001h
PORTC_RC4_LENGTH                         equ 0001h
PORTC_RC4_MASK                           equ 0010h
PORTC_RC5_POSN                           equ 0005h
PORTC_RC5_POSITION                       equ 0005h
PORTC_RC5_SIZE                           equ 0001h
PORTC_RC5_LENGTH                         equ 0001h
PORTC_RC5_MASK                           equ 0020h
PORTC_RC6_POSN                           equ 0006h
PORTC_RC6_POSITION                       equ 0006h
PORTC_RC6_SIZE                           equ 0001h
PORTC_RC6_LENGTH                         equ 0001h
PORTC_RC6_MASK                           equ 0040h
PORTC_RC7_POSN                           equ 0007h
PORTC_RC7_POSITION                       equ 0007h
PORTC_RC7_SIZE                           equ 0001h
PORTC_RC7_LENGTH                         equ 0001h
PORTC_RC7_MASK                           equ 0080h
PORTC_T1OSO_POSN                         equ 0000h
PORTC_T1OSO_POSITION                     equ 0000h
PORTC_T1OSO_SIZE                         equ 0001h
PORTC_T1OSO_LENGTH                       equ 0001h
PORTC_T1OSO_MASK                         equ 0001h
PORTC_T1OSI_POSN                         equ 0001h
PORTC_T1OSI_POSITION                     equ 0001h
PORTC_T1OSI_SIZE                         equ 0001h
PORTC_T1OSI_LENGTH                       equ 0001h
PORTC_T1OSI_MASK                         equ 0002h
PORTC_CCP1_POSN                          equ 0002h
PORTC_CCP1_POSITION                      equ 0002h
PORTC_CCP1_SIZE                          equ 0001h
PORTC_CCP1_LENGTH                        equ 0001h
PORTC_CCP1_MASK                          equ 0004h
PORTC_INT0_POSN                          equ 0003h
PORTC_INT0_POSITION                      equ 0003h
PORTC_INT0_SIZE                          equ 0001h
PORTC_INT0_LENGTH                        equ 0001h
PORTC_INT0_MASK                          equ 0008h
PORTC_INT1_POSN                          equ 0004h
PORTC_INT1_POSITION                      equ 0004h
PORTC_INT1_SIZE                          equ 0001h
PORTC_INT1_LENGTH                        equ 0001h
PORTC_INT1_MASK                          equ 0010h
PORTC_INT2_POSN                          equ 0005h
PORTC_INT2_POSITION                      equ 0005h
PORTC_INT2_SIZE                          equ 0001h
PORTC_INT2_LENGTH                        equ 0001h
PORTC_INT2_MASK                          equ 0020h
PORTC_TX_POSN                            equ 0006h
PORTC_TX_POSITION                        equ 0006h
PORTC_TX_SIZE                            equ 0001h
PORTC_TX_LENGTH                          equ 0001h
PORTC_TX_MASK                            equ 0040h
PORTC_RX_POSN                            equ 0007h
PORTC_RX_POSITION                        equ 0007h
PORTC_RX_SIZE                            equ 0001h
PORTC_RX_LENGTH                          equ 0001h
PORTC_RX_MASK                            equ 0080h
PORTC_T13CKI_POSN                        equ 0000h
PORTC_T13CKI_POSITION                    equ 0000h
PORTC_T13CKI_SIZE                        equ 0001h
PORTC_T13CKI_LENGTH                      equ 0001h
PORTC_T13CKI_MASK                        equ 0001h
PORTC_CCP2_POSN                          equ 0001h
PORTC_CCP2_POSITION                      equ 0001h
PORTC_CCP2_SIZE                          equ 0001h
PORTC_CCP2_LENGTH                        equ 0001h
PORTC_CCP2_MASK                          equ 0002h
PORTC_T0CKI_POSN                         equ 0003h
PORTC_T0CKI_POSITION                     equ 0003h
PORTC_T0CKI_SIZE                         equ 0001h
PORTC_T0CKI_LENGTH                       equ 0001h
PORTC_T0CKI_MASK                         equ 0008h
PORTC_SDA_POSN                           equ 0004h
PORTC_SDA_POSITION                       equ 0004h
PORTC_SDA_SIZE                           equ 0001h
PORTC_SDA_LENGTH                         equ 0001h
PORTC_SDA_MASK                           equ 0010h
PORTC_SCK_POSN                           equ 0005h
PORTC_SCK_POSITION                       equ 0005h
PORTC_SCK_SIZE                           equ 0001h
PORTC_SCK_LENGTH                         equ 0001h
PORTC_SCK_MASK                           equ 0020h
PORTC_CK_POSN                            equ 0006h
PORTC_CK_POSITION                        equ 0006h
PORTC_CK_SIZE                            equ 0001h
PORTC_CK_LENGTH                          equ 0001h
PORTC_CK_MASK                            equ 0040h
PORTC_DT_POSN                            equ 0007h
PORTC_DT_POSITION                        equ 0007h
PORTC_DT_SIZE                            equ 0001h
PORTC_DT_LENGTH                          equ 0001h
PORTC_DT_MASK                            equ 0080h
PORTC_NOT_FLTA_POSN                      equ 0001h
PORTC_NOT_FLTA_POSITION                  equ 0001h
PORTC_NOT_FLTA_SIZE                      equ 0001h
PORTC_NOT_FLTA_LENGTH                    equ 0001h
PORTC_NOT_FLTA_MASK                      equ 0002h
PORTC_NOT_FLTB_POSN                      equ 0002h
PORTC_NOT_FLTB_POSITION                  equ 0002h
PORTC_NOT_FLTB_SIZE                      equ 0001h
PORTC_NOT_FLTB_LENGTH                    equ 0001h
PORTC_NOT_FLTB_MASK                      equ 0004h
PORTC_NOT_SS_POSN                        equ 0006h
PORTC_NOT_SS_POSITION                    equ 0006h
PORTC_NOT_SS_SIZE                        equ 0001h
PORTC_NOT_SS_LENGTH                      equ 0001h
PORTC_NOT_SS_MASK                        equ 0040h
PORTC_nFLTA_POSN                         equ 0001h
PORTC_nFLTA_POSITION                     equ 0001h
PORTC_nFLTA_SIZE                         equ 0001h
PORTC_nFLTA_LENGTH                       equ 0001h
PORTC_nFLTA_MASK                         equ 0002h
PORTC_nFLTB_POSN                         equ 0002h
PORTC_nFLTB_POSITION                     equ 0002h
PORTC_nFLTB_SIZE                         equ 0001h
PORTC_nFLTB_LENGTH                       equ 0001h
PORTC_nFLTB_MASK                         equ 0004h
PORTC_T5CKI_POSN                         equ 0003h
PORTC_T5CKI_POSITION                     equ 0003h
PORTC_T5CKI_SIZE                         equ 0001h
PORTC_T5CKI_LENGTH                       equ 0001h
PORTC_T5CKI_MASK                         equ 0008h
PORTC_SDI_POSN                           equ 0004h
PORTC_SDI_POSITION                       equ 0004h
PORTC_SDI_SIZE                           equ 0001h
PORTC_SDI_LENGTH                         equ 0001h
PORTC_SDI_MASK                           equ 0010h
PORTC_SCL_POSN                           equ 0005h
PORTC_SCL_POSITION                       equ 0005h
PORTC_SCL_SIZE                           equ 0001h
PORTC_SCL_LENGTH                         equ 0001h
PORTC_SCL_MASK                           equ 0020h
PORTC_nSS_POSN                           equ 0006h
PORTC_nSS_POSITION                       equ 0006h
PORTC_nSS_SIZE                           equ 0001h
PORTC_nSS_LENGTH                         equ 0001h
PORTC_nSS_MASK                           equ 0040h
PORTC_SDO_POSN                           equ 0007h
PORTC_SDO_POSITION                       equ 0007h
PORTC_SDO_SIZE                           equ 0001h
PORTC_SDO_LENGTH                         equ 0001h
PORTC_SDO_MASK                           equ 0080h
PORTC_FLTA_POSN                          equ 0001h
PORTC_FLTA_POSITION                      equ 0001h
PORTC_FLTA_SIZE                          equ 0001h
PORTC_FLTA_LENGTH                        equ 0001h
PORTC_FLTA_MASK                          equ 0002h
PORTC_FLTB_POSN                          equ 0002h
PORTC_FLTB_POSITION                      equ 0002h
PORTC_FLTB_SIZE                          equ 0001h
PORTC_FLTB_LENGTH                        equ 0001h
PORTC_FLTB_MASK                          equ 0004h
PORTC_SS_POSN                            equ 0006h
PORTC_SS_POSITION                        equ 0006h
PORTC_SS_SIZE                            equ 0001h
PORTC_SS_LENGTH                          equ 0001h
PORTC_SS_MASK                            equ 0040h
PORTC_PA2_POSN                           equ 0001h
PORTC_PA2_POSITION                       equ 0001h
PORTC_PA2_SIZE                           equ 0001h
PORTC_PA2_LENGTH                         equ 0001h
PORTC_PA2_MASK                           equ 0002h
PORTC_PA1_POSN                           equ 0002h
PORTC_PA1_POSITION                       equ 0002h
PORTC_PA1_SIZE                           equ 0001h
PORTC_PA1_LENGTH                         equ 0001h
PORTC_PA1_MASK                           equ 0004h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0F84h
// bitfield definitions
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_NOT_MCLR_POSN                      equ 0003h
PORTE_NOT_MCLR_POSITION                  equ 0003h
PORTE_NOT_MCLR_SIZE                      equ 0001h
PORTE_NOT_MCLR_LENGTH                    equ 0001h
PORTE_NOT_MCLR_MASK                      equ 0008h
PORTE_nMCLR_POSN                         equ 0003h
PORTE_nMCLR_POSITION                     equ 0003h
PORTE_nMCLR_SIZE                         equ 0001h
PORTE_nMCLR_LENGTH                       equ 0001h
PORTE_nMCLR_MASK                         equ 0008h
PORTE_MCLR_POSN                          equ 0003h
PORTE_MCLR_POSITION                      equ 0003h
PORTE_MCLR_SIZE                          equ 0001h
PORTE_MCLR_LENGTH                        equ 0001h
PORTE_MCLR_MASK                          equ 0008h
PORTE_CCP9E_POSN                         equ 0003h
PORTE_CCP9E_POSITION                     equ 0003h
PORTE_CCP9E_SIZE                         equ 0001h
PORTE_CCP9E_LENGTH                       equ 0001h
PORTE_CCP9E_MASK                         equ 0008h
PORTE_PC3E_POSN                          equ 0003h
PORTE_PC3E_POSITION                      equ 0003h
PORTE_PC3E_SIZE                          equ 0001h
PORTE_PC3E_LENGTH                        equ 0001h
PORTE_PC3E_MASK                          equ 0008h

// Register: TMR5
#define TMR5 TMR5
TMR5                                     equ 0F87h

// Register: TMR5L
#define TMR5L TMR5L
TMR5L                                    equ 0F87h

